Revit 2026 API

# ConcreteConcreteBmMap Property

---

The property labeled "Image" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteBmMap { get; }
```
```vb
Public Shared ReadOnly Property ConcreteBmMap As String
	Get
```
```cpp
public:
static property String^ ConcreteBmMap {
	String^ get ();
}
```
```fsharp
static member ConcreteBmMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace